Revit 2027 API
PartMaker.GetSourceElementIds Method
 Get the source elements for the PartMaker.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public ICollection<LinkElementId> GetSourceElementIds()
Public Function GetSourceElementIds As ICollection(Of LinkElementId)
public:
ICollection<LinkElementId^>^ GetSourceElementIds()
member GetSourceElementIds : unit -> ICollection<LinkElementId>
Return Value
ICollection<LinkElementId>
 Elements that are the sources for this PartMaker.
See Also
Reference
PartMaker Class
Autodesk.Revit.DB Namespace